Revit 2027 API
BuiltInFailures.StairRampFailures.RiserHeightIsTooSmall Property
 Riser height is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RiserHeightIsTooSmall { get; }
Public Shared ReadOnly Property RiserHeightIsTooSmall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RiserHeightIsTooSmall {
	FailureDefinitionId^ get ();
}
static member RiserHeightIsTooSmall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace